Public Attributes | List of all members
API_AnalyticalSupport_Settings Struct Reference
Analytical Model
Describes the Structural Analytical Model Analytical Support settings. More...
#include <APIdefs_AnalyticalElements.h>
 Public Attributes
API_AnalyticalSupport_SupportType  | supportType
The type of the Analytical Support.
API_AnalyticalSupport_SupportValues  | supportValues
The Analytical Support values.
API_AnalyticalCoordSysDirection  | coordinateSystem
The coordinate system definition.
Detailed Description
Describes the Structural Analytical Model Analytical Support settings.
Since
Archicad 25
Member Data Documentation
◆ coordinateSystem
 API_AnalyticalSupport_Settings::coordinateSystem
The coordinate system definition.
◆ supportType
 API_AnalyticalSupport_Settings::supportType
The type of the Analytical Support.
◆ supportValues
 API_AnalyticalSupport_Settings::supportValues
The Analytical Support values.